Repository: robin13901/XFin
Catalog: lib/l10n/app_*.arb
Languages: de

source: Account Name
de: Kontoname

source: Please enter a name
de: Bitte geben Sie einen Namen ein

# accountAlreadyExists
source: An account with this name already exists
de: Ein Konto mit diesem Namen existiert bereits

source: Value already exists
de: Wert existiert bereits

source: Initial Balance
de: Anfangssaldo

source: Please enter a balance
de: Bitte geben Sie einen Saldo ein

source: Invalid number
de: Ungültige Nummer

source: Initial balance cannot be negative
de: Der Anfangssaldo darf nicht negativ sein

# amountTooManyDecimalPlaces
source: Maximum of 2 decimal places allowed
de: Maximal 2 Nachkommastellen erlaubt

source: Type
de: Typ

source: Cash
de: Bargeld

source: Bank Account
de: Bankkonto

source: Add Asset
de: Asset hinzufügen

source: No assets added yet
de: Noch keine Assets hinzugefügt

source: Next
de: Weiter

# cashInfo
source: Only FIAT currencies can be credited to cash accounts.
de: TODO...

# bankAccountInfo
source: Only the base currency can be credited to bank accounts.
de: TODO...

# portfolioInfo
source: All asset types can be credited to portfolio accounts.
de: TODO...

# cryptoWalletInfo
source: Only crypto assets can be credited to crypto wallets.
de: TODO...

source: Asset already added
de: Asset bereits hinzugefügt

source: Crypto Wallet
de: Krypto Wallet

source: Cancel
de: Abbrechen

source: Save
de: Speichern

source: Analysis
de: Analyse

source: Accounts
de: Konten

source: Bookings
de: Buchungen

source: More
de: Mehr

source: Settings
de: Einstellungen

source: Language
de: Sprache

source: English
de: Englisch

source: German
de: Deutsch

source: Theme
de: Thema

source: Light
de: Hell

source: Dark
de: Dunkel

source: Insufficient balance
de: Unzureichender Kontostand

# insufficientShares
source: Not enough shares
de: Nicht genügend Anteile

source: Merge bookings?
de: Buchungen zusammenführen?

# mergeBookingsQuestion
source: A similar booking already exists. Do you want to merge them?
de: Eine ähnliche Buchung existiert bereits. Möchten Sie diese zusammenführen?

source: Create new
de: Neu erstellen

source: Merge
de: Zusammenführen

source: Date
de: Datum

# datetime
source: Time
de: Zeitpunkt

source: Amount
de: Betrag

source: Please enter an amount!
de: Bitte gib einen Betrag an

source: Invalid input!
de: Ungültige Eingabe

source: Too many decimal places!
de: Zu viele Nachkommastellen

source: Too many characters
de: Zu viele Zeichen

source: Category
de: Kategorie

source: Please enter a category!
de: Bitte gib eine Kategorie an!

# categoryReservedForTransfer
source: This category is reserved for transfers.
de: Diese Kategorie ist für Überweisungen reserviert.

source: Account
de: Konto

source: Please select an account!
de: Bitte wähle ein Konto!

source: Notes
de: Notizen

source: Exclude from average
de: Vom Durchschnitt ausschließen

# dateCannotBeInTheFuture
source: The date cannot be in the future.
de: Das Datum darf nicht in der Zukunft liegen.

# accountHasReferencesArchiveInstead
source: This account has references and cannot be deleted. Would you like to archive it instead?
de: Dieses Konto hat Referenzen und kann nicht gelöscht werden. Möchten Sie es stattdessen archivieren?

source: Archive
de: Archivieren

source: Confirm
de: Bestätigen

source: Unarchive Account
de: Konto dearchivieren

# confirmUnarchiveAccount
source: Do you want to unarchive this account?
de: Möchten Sie dieses Konto dearchivieren?

source: Error
de: Fehler

# noActiveAccounts
source: No active accounts yet
de: Noch keine aktiven Konten vorhanden

source: Archived Accounts
de: Archivierte Konten

# anErrorOccurred
source: An error occurred: {error}
de: Ein Fehler ist aufgetreten: {error}

# valueMustNotBeZero
source: Value can not be 0
de: Wert darf nicht 0 sein

source: No bookings yet
de: Noch keine Buchungen vorhanden

source: Unknown Account
de: Unbekanntes Konto

# noAssets
source: No assets yet
de: Noch keine Assets vorhanden

# assetHasReferences
source: This asset has references and cannot be deleted.
de: Dieses Asset hat Referenzen und kann nicht gelöscht werden.

# pleaseEnterAssetName
source: Please enter an asset name
de: Bitte geben Sie einen Asset-Namen ein

# assetAlreadyExists
source: An asset with this name already exists
de: Ein Asset mit diesem Namen existiert bereits

source: Currency Symbol
de: Währungssymbol

source: Please enter a ticker symbol
de: Bitte geben Sie ein Tickersymbol ein

# tickerSymbolAlreadyExists
source: An asset with this ticker symbol already exists
de: Ein Asset mit diesem Tickersymbol existiert bereits

source: Stock
de: Aktie

source: Crypto
de: Krypto

# fiat
source: Fiat Currency
de: Fiat

source: Fund
de: Fonds

source: Derivative
de: Derivat

source: Bond
de: Anleihe

source: Commodity
de: Rohstoff

source: Value
de: Wert

# sharesOwned
source: Shares
de: Anteile

source: Cost Basis
de: Kostenbasis

source: Net Cost Basis
de: Netto-Kostenbasis

source: Broker Cost Basis
de: Broker-Kostenbasis

source: Update
de: Aktualisieren

# noTrades
source: No trades yet
de: Noch keine Trades vorhanden

source: Price per Share
de: Kurs

source: Fee
de: Gebühr

source: Clearing Account
de: Verrechnungskonto

source: Investment Account
de: Investment-Konto

source: Please select a type!
de: Bitte wählen Sie einen Typ!

source: Please select an asset!
de: Bitte wählen Sie ein Asset!

source: * Required field
de: * Pflichtfeld

source: Please enter a valid number!
de: Bitte geben Sie eine gültige Zahl ein!

source: Please enter a valid fee!
de: Bitte geben Sie eine gültige Gebühr ein!

source: Shares
de: Anteile

source: Tax
de: Steuer

# pleaseSelectCurrency
source: Please select a currency!
de: Bitte wählen Sie eine Währung!

source: Select Currency
de: Währung auswählen

# currencySelectionPrompt
source: Please select your base currency. This cannot be changed later.
de: Bitte wählen Sie Ihre Basiswährung. Dies kann später nicht mehr geändert werden.

source: Return on Investment
de: Rendite

# actionCancelledDueToDataInconsistency
source: This action is not possible because it would lead to data inconsistency
de: Diese Aktion ist nicht möglich, da sie zu Dateninkonsistenz führen würde

# onlyBaseCurrencyCanBeBookedOnBankAccount
source: Only the base currency can be booked on a bank account.
de: Nur die Basiswährung kann auf einen Bank Account gebucht werden.

# onlyCryptoCanBeBookedOnCryptoWallet
source: Only crypto can be booked on a crypto wallet.
de: Nur Krypto kann auf eine Krypto Wallet gebucht werden.

# onlyCurrenciesCanBeBookedOnCashAccount
source: Only currencies can be booked on a cash account.
de: Nur Währungen können auf einen Cash Account gebucht werden.

# sendingAndReceivingMustDiffer
source: Sending and receiving account must differ
de: Sender- und Empfängerkonto müssen unterschiedlich sein

source: Sending Account
de: Senderkonto

source: Receiving Account
de: Empfängerkonto

# valueMustBeGreaterZero
source: Value must be > 0
de: Wert muss > 0 sein

# valueMustBeGreaterEqualZero
source: Value must be ≥ 0
de: Wert muss ≥ 0 sein

# valueCannotBeZero
source: Value must not be 0
de: Wert darf nicht 0 sein

source: No transfers yet
de: Noch keine Überweisungen vorhanden

source: Transfers
de: Überweisung

# isGenerated
source: Created by standing order
de: Erstellt durch Dauerauftrag

# updateWouldBreakAccountBalanceHistory
source: The changes cannot be saved. The entered values would lead to inconsistencies in the account balance history of one or more of the accounts involved.
de: Die Änderungen können nicht gespeichert werden. Die eingegebenen Werte würden zu Inkonsistenzen im Verlauf des Kontostandes eines oder mehrerer beteiligter Konten führen.

source: Import Database
de: Datenbank importieren

source: Export Database
de: Datenbank exportieren

# importDatabaseWarning
source: Importing will replace all current data. This cannot be undone. Continue?
de: Beim Import werden alle vorhandenen Daten überschrieben. Dieser Vorgang kann nicht rückgängig gemacht werden. Fortfahren?

source: Import failed.
de: Import fehlgeschlagen.

source: Export failed.
de: Export fehlgeschlagen.

source: File saved successfully.
de: Datei erfolgreich gespeichert.

source: Selected file does not exist.
de: Ausgewählte Datei existiert nicht.

source: Selected file cannot be accessed.
de: Ausgewählte Datei kann nicht geöffnet werden.

source: Database replaced successfully.
de: Datenbank erfolgreich ersetzt.

source: Database replaced but reopen failed.
de: Datenbank ersetzt, aber Öffnen fehlgeschlagen.

source: Delete
de: Löschen

source: Delete Account
de: Konto löschen

source: Delete Asset
de: Asset löschen

source: Delete Booking
de: Buchung löschen

source: Delete Trade
de: Trade löschen

source: Delete Transfer
de: Überweisung löschen

# deleteAccountConfirmation
source: Are you sure you want to delete this account?
de: Sind Sie sicher, dass Sie dieses Konto löschen möchten?

# deleteAssetConfirmation
source: Are you sure you want to delete this asset?
de: Sind Sie sicher, dass Sie dieses Asset löschen möchten?

# deleteBookingConfirmation
source: Are you sure you want to delete this booking?
de: Sind Sie sicher, dass Sie diese Buchung löschen möchten?

# deleteTradeConfirmation
source: Are you sure you want to delete this trade?
de: Sind Sie sicher, dass Sie diesen Trade löschen möchten?

# deleteTransferConfirmation
source: Are you sure you want to delete this transfer?
de: Sind Sie sicher, dass Sie diese Überweisung löschen möchten?

source: Cannot Delete Account
de: Konto kann nicht gelöscht werden

source: Cannot Delete Asset
de: Asset kann nicht gelöscht werden

# cannotDeleteOrArchiveAccount
source: Deletion or archiving not possible
de: Löschen oder Archivieren nicht möglich

# cannotDeleteOrArchiveAccountLong
source: Accounts can only be deleted when they have no references. This account has references and cannot be deleted. Accounts with references can be archived but only if the balance is 0.
de: Konten können nur gelöscht werden, wenn sie keine Referenzen mehr haben. Dieses Konto hat Referenzen und kann nicht gelöscht werden. Konten mit Referenzen können archiviert werden, jedoch nur dann wenn der Saldo 0 beträgt.
